<div style="color:white;
           display:fill;
           border-radius:5px;
           background-color:#5642C5;
           font-size:200%;
           font-family:Arial;letter-spacing:0.5px">

<p width = 20%, style="padding: 10px;
              color:white;">
SQL: Introduction and Basic Querying
</p>
</div>

DS-NTL-010824
<p>Phase 2</p>
<br>
<br>

<div align = "right">
<img src="Images/flatiron-school-logo.png" align = "right" width="200"/>
</div>

#### Databases

Data for organizations: typically stored in a **database**.

- Database: organized collection of structured information.
- Typically fairly large and hosted by dedicated servers.
- A database controlled by a database management system (DBMS).

<div align = "center">
    <center><img src="Images/dbms.jpg" align = "center" width="500"/></center>
</div>

With DBMS: store, update, share, and access specific subset of database. 

- CSVs and JSONs are often extracts of some data from a database.

#### The relational database
<br>
<div align = "center">
    <center><img src="Images/tables_relational.png" align = "center" width="700"/></center>
</div>

Tables are linked together by relationships.

  Why relational databases are great and what came before (first 5 modules): <br>
  https://mariadb.com/kb/en/database-theory/

Common DBMS for Relational Databases
<br>
<div>
    <center><img src="Images/postgresql.png"  width="200"/></center>
    <center><img src="Images/mysql.png"  width="300"/></center>
    <center><img src="Images/SQLite-Python.jpg" align = "center" width="200"/></center>
</div>
      
</div>

#### Structured Query Language

- De-facto king of languages for interacting with relational databases and their DBMS.
- Invaluable for you in almost any data role. 
- You will use it often to get the data that you need for your analyses.

Let's get into using SQL!

In [1]:
# import sqlite
import sqlite3
import pandas as pd

Interacting with a sqlite database.
- Connect to database 
- Create interface to ask database for stuff
- After connection established:
    1. Execute query 
    2. Fetch result 
- Close connection to database when done with queries.

Commands:
- conn = sqlite3.connect(database)
- cursor_obj = connection.cursor()
- Query database/get result:
    1. cursor.execute(SQL_query)
    2. cursor.fetchall()
- connection.close()

First, we'll use the sqlite3 package to create a connection to the database, which is currently just stored in that file on our hard drive.

In [2]:
con = sqlite3.connect('data/flights.db')

Next, we'll create a cursor to interact with the database. Like the cursor for your mouse interacts with pixels on your screen, this cursor will allow us to interact with the elements of the database.

In [3]:
cursor_obj = con.cursor()

See tables in the sqlite database via command line.

In [4]:
%%bash 

sqlite3 data/flights.db
.tables

airlines  airports  routes

Get schema of sqlite database: whole or single table

In [5]:
%%bash
sqlite3 data/flights.db
.schema airports

CREATE TABLE airports (
[index] INTEGER,
  [id] TEXT,
  [name] TEXT,
  [city] TEXT,
  [country] TEXT,
  [code] TEXT,
  [icao] TEXT,
  [latitude] TEXT,
  [longitude] TEXT,
  [altitude] TEXT,
  [offset] TEXT,
  [dst] TEXT,
  [timezone] TEXT
);
CREATE INDEX ix_airports_index ON airports ([index]);

#### SELECT statement

Let's explore the following clauses and structure:

```sql
SELECT columns ( * for all fields)
FROM table
WHERE condition
ORDER BY columns
LIMIT number (limits to first n entries of table)
```

#### Example

Use the cursor object to execute and retrieve the results of the following query:

Retrieve all fields for the first five entries of the database.

In [6]:
# EXECUTE THAT QUERY

query = cursor_obj.execute("""
SELECT *
FROM airports
LIMIT 5
""")

In [7]:
# FETCH THE RESULTS

query.fetchall()

[(0,
  '1',
  'Goroka',
  'Goroka',
  'Papua New Guinea',
  'GKA',
  'AYGA',
  '-6.081689',
  '145.391881',
  '5282',
  '10',
  'U',
  'Pacific/Port_Moresby'),
 (1,
  '2',
  'Madang',
  'Madang',
  'Papua New Guinea',
  'MAG',
  'AYMD',
  '-5.207083',
  '145.7887',
  '20',
  '10',
  'U',
  'Pacific/Port_Moresby'),
 (2,
  '3',
  'Mount Hagen',
  'Mount Hagen',
  'Papua New Guinea',
  'HGU',
  'AYMH',
  '-5.826789',
  '144.295861',
  '5388',
  '10',
  'U',
  'Pacific/Port_Moresby'),
 (3,
  '4',
  'Nadzab',
  'Nadzab',
  'Papua New Guinea',
  'LAE',
  'AYNZ',
  '-6.569828',
  '146.726242',
  '239',
  '10',
  'U',
  'Pacific/Port_Moresby'),
 (4,
  '5',
  'Port Moresby Jacksons Intl',
  'Port Moresby',
  'Papua New Guinea',
  'POM',
  'AYPY',
  '-9.443383',
  '147.22005',
  '146',
  '10',
  'U',
  'Pacific/Port_Moresby')]

- execute, fetchall protocol gets data in python list form.
- can issue commands to create things in database.

Now close the connection to the database when you are done.

In [8]:
con.close()
con

When *just retrieving* tabular data:

- Pandas has pd.read_sql(query, database_connection) command.

In [9]:
airports_query = \
"""
SELECT *
FROM airports
"""

Make sure you have a connection to the sql database open.

In [10]:
con = sqlite3.connect('data/flights.db')

In [11]:
# requires reference to open database connection
query_result_df = pd.read_sql(airports_query, con)
query_result_df.head()

,index,id,name,city,country,code,icao,latitude,longitude,altitude,offset,dst,timezone
0,0,1,Goroka,Goroka,Papua New Guinea,GKA,AYGA,-6.081689,145.391881,5282,10,U,Pacific/Port_Moresby
1,1,2,Madang,Madang,Papua New Guinea,MAG,AYMD,-5.207083,145.7887,20,10,U,Pacific/Port_Moresby
2,2,3,Mount Hagen,Mount Hagen,Papua New Guinea,HGU,AYMH,-5.826789,144.295861,5388,10,U,Pacific/Port_Moresby
3,3,4,Nadzab,Nadzab,Papua New Guinea,LAE,AYNZ,-6.569828,146.726242,239,10,U,Pacific/Port_Moresby
4,4,5,Port Moresby Jacksons Intl,Port Moresby,Papua New Guinea,POM,AYPY,-9.443383,147.22005,146,10,U,Pacific/Port_Moresby

Selecting particular columns:

In [12]:
query_result_df = pd.read_sql("""

SELECT city, country 
FROM airports

""", con)

query_result_df.head(5)

           city           country
0        Goroka  Papua New Guinea
1        Madang  Papua New Guinea
2   Mount Hagen  Papua New Guinea
3        Nadzab  Papua New Guinea
4  Port Moresby  Papua New Guinea

#### DISTINCT
- Select only unique results of query.

In [13]:
query_result = pd.read_sql("""

SELECT DISTINCT country
FROM airports

""", con)

query_result.head()

            country
0  Papua New Guinea
1         Greenland
2           Iceland
3            Canada
4           Algeria

**Example**

Get a list of the distinct cities in the database and store it as a pandas Series. What is the number of cities represented in this database?

In [14]:
query_result = pd.read_sql("""

SELECT DISTINCT city
FROM airports

""", con)
   
query_result.head()

           city
0        Goroka
1        Madang
2   Mount Hagen
3        Nadzab
4  Port Moresby

In [15]:
query_series = query_result['city']

In [16]:
query_series.shape

(6977,)

**Example**

Get the cities for each airport in the database and store it as a pandas Series. 

Then get me the number of airports in each city and the number of unique cities. You can use Pandas functions for this.

In [17]:
cities = pd.read_sql("""
SELECT city, name
FROM airports

""", con)

cities["city"].value_counts()
#cities.shape

London       21
New York     13
Hong Kong    12
Berlin       10
Paris        10
             ..
Hemavan       1
Cobija        1
Jahrom        1
Meknes        1
Salinas       1
Name: city, Length: 6977, dtype: int64

#### AS modifier

`AS`: renaming a column in the query and returned result.

In [18]:
sql_query = pd.read_sql("""

SELECT city AS Airport_City, 
       country AS "Airport Country"
FROM airports

""", con)

sql_query.head()

   Airport_City   Airport Country
0        Goroka  Papua New Guinea
1        Madang  Papua New Guinea
2   Mount Hagen  Papua New Guinea
3        Nadzab  Papua New Guinea
4  Port Moresby  Papua New Guinea

Some SQL dialects do not require the AS statement:

In [19]:
sql_query = pd.read_sql("""

SELECT city "Airport City", 
       country "Airport Country"
FROM airports

""", con)

sql_query.head()

   Airport City   Airport Country
0        Goroka  Papua New Guinea
1        Madang  Papua New Guinea
2   Mount Hagen  Papua New Guinea
3        Nadzab  Papua New Guinea
4  Port Moresby  Papua New Guinea

#### Functions
Can use predefined functions in SELECT statements:
<br>
<br>
SELECT FUNCTION(columns)
<br>
FROM table

Applies function to the each column and spits out new table.

Functions can be: 
- Transformations on columns:
    - Convert each element in a string column to upper case.
- Aggregation:
    - statistic on each field in a table 
    - e.g. max, min, mean, sum, etc.

#### Transformation

In [20]:
sql_query_df = pd.read_sql("""

SELECT UPPER(name) AS "AIRPORT NAMES IN CAPS",
       LENGTH(name) AS "Airport Name Length"
       
FROM airports

""", con)

sql_query_df.head()

        AIRPORT NAMES IN CAPS  Airport Name Length
0                      GOROKA                    6
1                      MADANG                    6
2                 MOUNT HAGEN                   11
3                      NADZAB                    6
4  PORT MORESBY JACKSONS INTL                   26

#### Aggregation
- MAX()
- MIN()
- SUM()
- AVG()
- COUNT()

Get count of entries in table:

In [21]:
sql_query_df = pd.read_sql("""

SELECT COUNT(*) AS count
FROM airports


""", con)

sql_query_df

   count
0   8107

Get count of non-missing entries in a given field:


SELECT COUNT(field_name)
FROM table

In [22]:
sql_query_df = pd.read_sql("""

SELECT COUNT(code) as code_count
FROM airports



""", con)

sql_query_df

   code_count
0        5880

Distinct countries in country field of airports table:

In [23]:
sql_query_df = pd.read_sql("""

SELECT COUNT(Distinct country) as country_count
FROM airports


""", con)

sql_query_df

   country_count
0            240

Let's take a look at our original table again.

In [24]:
sql_query_df = pd.read_sql("""

SELECT * 
FROM airports
LIMIT 5

""", con)

sql_query_df

,index,id,name,city,country,code,icao,latitude,longitude,altitude,offset,dst,timezone
0,0,1,Goroka,Goroka,Papua New Guinea,GKA,AYGA,-6.081689,145.391881,5282,10,U,Pacific/Port_Moresby
1,1,2,Madang,Madang,Papua New Guinea,MAG,AYMD,-5.207083,145.7887,20,10,U,Pacific/Port_Moresby
2,2,3,Mount Hagen,Mount Hagen,Papua New Guinea,HGU,AYMH,-5.826789,144.295861,5388,10,U,Pacific/Port_Moresby
3,3,4,Nadzab,Nadzab,Papua New Guinea,LAE,AYNZ,-6.569828,146.726242,239,10,U,Pacific/Port_Moresby
4,4,5,Port Moresby Jacksons Intl,Port Moresby,Papua New Guinea,POM,AYPY,-9.443383,147.22005,146,10,U,Pacific/Port_Moresby

Get maximum altitude in dataset along with corresponding airport.

In [25]:
sql_query_df = pd.read_sql("""

SELECT name AS "Airport Name", 
    MAX(altitude) AS "Altitude (ft)"      
FROM airports

""", con)

sql_query_df

     Airport Name Altitude (ft)
0  Dauphin Barker           999

Something is wrong here. Make sure that your column is the right datatype for the function to avoid unexpected results.

In [26]:
%%bash
sqlite3 data/flights.db
.schema airports

CREATE TABLE airports (
[index] INTEGER,
  [id] TEXT,
  [name] TEXT,
  [city] TEXT,
  [country] TEXT,
  [code] TEXT,
  [icao] TEXT,
  [latitude] TEXT,
  [longitude] TEXT,
  [altitude] TEXT,
  [offset] TEXT,
  [dst] TEXT,
  [timezone] TEXT
);
CREATE INDEX ix_airports_index ON airports ([index]);

#### `CAST()`

- can enforce typing on a given field.

In [27]:
sql_query_df = pd.read_sql("""

SELECT name AS "Airport Name", 
       MAX(CAST(altitude as int )) AS "Altitude (ft)"
       
FROM airports

""", con)

sql_query_df

      Airport Name  Altitude (ft)
0  Yading Daocheng          14472

Let's get the average altitude:

In [28]:
sql_query_df = pd.read_sql("""

SELECT AVG(CAST(altitude as int)) AS "Average Altitude (ft)"
FROM airports

""", con)

sql_query_df

   Average Altitude (ft)
0             933.449365

#### Exercise


Which country has the northern-most airport? 

> _Hint: Look for the highest latitude_

In [31]:
pd.read_sql("""

SELECT name AS airport_name, country, MAX(CAST(latitude AS float))
FROM airports


""", con)

  airport_name country  MAX(CAST(latitude AS float))
0        Alert  Canada                     82.517778

<details>
    <summary><b><u>Click Here for Answer Code</u></b></summary>

```python 
pd.read_sql("""
            
SELECT name AS airport_name, country, MAX(CAST(latitude AS float))
FROM airports


""", con)

```
</details>

So far:
- Selecting fields (columns) and computing functions of them.

Want to: 
- Select records (rows) matching particular criteria.

#### WHERE: Selecting rows via filtering

SELECT columns
<br>
FROM table
<br>
WHERE filter_column meets condition

#### Filtering by comparison: WHERE statement

Commonly filter by how column compares to a value.

SELECT column1, column2 
FROM table
WHERE column2 > number

| Operator | Meaning | 
| --- | --- |
| \= | equal |
| \<> | not equal |
| \<  |  less than |
| \> | greater than |
| \<=  | less than or equal to |
| \>= | greater than or equal to |

**Example**

Get a airport, their name, city and country for which the airport's altitude is less than sea level.

In [32]:
sql_query_df = pd.read_sql("""
SELECT name, city, country,
CAST(altitude AS int) AS altit

FROM airports

WHERE altit < 0


""", con)

sql_query_df

               name        city        country  altit
0          Schiphol   Amsterdam    Netherlands    -11
1          Lelystad    Lelystad    Netherlands    -13
2         Rotterdam   Rotterdam    Netherlands    -15
3   Alexandria Intl  Alexandria          Egypt     -6
4          En Yahav   Eyn-yahav         Israel   -164
5      I Bar Yehuda     Metzada         Israel  -1266
6             Rasht       Rasht           Iran    -40
7            Ramsar      Ramsar           Iran    -70
8         Astrakhan   Astrakhan         Russia    -65
9       Imperial Co    Imperial  United States    -54
10    El Centro Naf   El Centro  United States    -42
11  Noshahr Airport     Noshahr           Iran    -61
12   Gorgan Airport      Gorgan           Iran    -24

#### NOT operator
- Before conditional in `WHERE` clause.
- Negates conditional.

In [33]:
sql_query_df = pd.read_sql("""

SELECT name AS "Airport Name", 
       CAST(latitude AS float) AS "Airport Latitude",
       CAST(altitude AS int) AS "Altitude (ft)"
       
FROM airports

WHERE NOT "Altitude (ft)" <= 12500

""", con)

sql_query_df

             Airport Name  Airport Latitude  Altitude (ft)
0            El Alto Intl        -16.513339          13325
1   Capitan Nicolas Rojas        -19.543069          12913
2                 Juliaca        -15.467103          12552
3           Lhasa-Gonggar         29.297778          13136
4    Qamdo Bangda Airport         30.553600          14219
5               Irkutsk-2         52.367800          13411
6            Yushu Batang         32.825000          13000
7                   Gunsa         32.100270          13780
8        Kangding Airport         30.157500          14042
9      Copacabana Airport        -16.183326          12591
10        Yading Daocheng         29.323100          14472

#### Chaining conditionals for filtering
- AND
- OR

#### AND
Get all airports with:
- Altitude > 12500 ft.
- Latitude > 30 degrees

In [34]:
sql_query_df = pd.read_sql("""

SELECT name AS "Airport Name", 
       CAST(latitude AS float) AS "Airport Latitude",
       CAST(altitude AS int) AS "Altitude (ft)"
       
FROM airports

WHERE "Altitude (ft)" > 12500 AND "Airport Latitude" > 30

""", con)

sql_query_df

           Airport Name  Airport Latitude  Altitude (ft)
0  Qamdo Bangda Airport          30.55360          14219
1             Irkutsk-2          52.36780          13411
2          Yushu Batang          32.82500          13000
3                 Gunsa          32.10027          13780
4      Kangding Airport          30.15750          14042

#### OR
Get all airports and their latitude/longitude in Iceland or Denmark.

In [35]:
sql_query_df = pd.read_sql("""

SELECT name AS "Airport Name", 
        country,
       CAST(latitude AS float) AS "Latitude",
       CAST(longitude AS float) AS "Longitude"
       
FROM airports

WHERE country = "Iceland" OR country = "Denmark"

""", con)

sql_query_df.head(12)

                      Airport Name  country   Latitude  Longitude
0                         Akureyri  Iceland  65.659994 -18.072703
1                      Egilsstadir  Iceland  65.283333 -14.401389
2                     Hornafjordur  Iceland  64.295556 -15.227222
3                          Husavik  Iceland  65.952328 -17.425978
4                       Isafjordur  Iceland  66.058056 -23.135278
5   Keflavik International Airport  Iceland  63.985000 -22.605556
6                   Patreksfjordur  Iceland  65.555833 -23.965000
7                        Reykjavik  Iceland  64.130000 -21.940556
8                     Siglufjordur  Iceland  66.133333 -18.916667
9                   Vestmannaeyjar  Iceland  63.424303 -20.278875
10                          Aarhus  Denmark  56.300017  10.619008
11                         Billund  Denmark  55.740322   9.151778

#### Exercise

Get the name, lat/long, and altitude for the airport with the maximum altitude considering only airports in Chile and Argentina.

In [36]:
sql_query_df = pd.read_sql("""

SELECT name AS airport_name,
    CAST(latitude as float) AS latitude,
    CAST(longitude as float) AS longitude,
    MAX(CAST(altitude as int)) AS altitude

    FROM airports

    WHERE country = "Chile" OR country = "Argentina"


""", con)

sql_query_df

  airport_name   latitude  longitude  altitude
0    La Quiaca -22.150556   -65.5775     11414

<details>
    <summary><b><u>Click Here for Answer Code</u></b></summary>

```python 
sql_query_df = pd.read_sql("""

SELECT name AS airport_name,
    CAST(latitude as float) AS latitude,
    CAST(longitude as float) AS longitude,
    MAX(CAST(altitude as int)) AS altitude
    
    FROM airports
    
    WHERE country = "Chile" OR country = "Argentina"
    

""", con)

sql_query_df

```
</details>

#### BETWEEN

- Writing multiple inequalities for selecting ranges with `WHERE` statement: annoying.

- BETWEEN ... AND ... solves this problem.

#### Example 
Get the airport name, country, latitude, and longitude where latitude is between 48 and 51.

In [39]:
sql_query_df = pd.read_sql("""

SELECT name AS "Airport Name", 
        country,
       CAST(latitude AS float) AS "Latitude",
       CAST(longitude AS float) AS "Longitude"
       
FROM airports

WHERE Latitude BETWEEN 48 AND 51
""", con)

sql_query_df

                        Airport Name        country   Latitude   Longitude
0                Winnipeg St Andrews         Canada  50.056389  -97.032500
1                             Tofino         Canada  49.082222 -125.772500
2                        Baie Comeau         Canada  49.132500  -68.204444
3                         Bagotville         Canada  48.330555  -70.996391
4                     Campbell River         Canada  49.950832 -125.270833
..                               ...            ...        ...         ...
562   Pender Harbour Water Aerodrome         Canada  49.616667 -124.016667
563  Mansons Landing Water Aerodrome         Canada  50.066667 -124.983333
564             Port McNeill Airport         Canada  50.575556 -127.028611
565     Sullivan Bay Water Aerodrome         Canada  50.883333 -126.833333
566             Deer Harbor Seaplane  United States  48.618397 -123.005960

[567 rows x 4 columns]

 #### Exercise
Get the name, lat/long, and altitude for the airports with altitude between 0 and 2000 ft considering only airports in Chile and Argentina.

In [40]:
sql_query_df = pd.read_sql("""

SELECT name, country,
CAST(latitude as float) AS latit,
CAST(longitude as float) AS longit,
CAST(altitude as int) AS altit

FROM airports

WHERE ( (country == 'Chile') OR (country == 'Argentina') )
AND 
altit BETWEEN 0 AND 2000


""", con)

sql_query_df

                        name    country      latit     longit  altit
0      Aeropuerto de Rafaela  Argentina -31.282072 -61.501594    100
1      Comodoro Pierrestegui  Argentina -31.296944 -57.996631    112
2               Gualeguaychu  Argentina -33.010278 -58.613056     75
3                      Junin  Argentina -34.545889 -60.930556    262
4            General Urquiza  Argentina -31.794778 -60.480361    243
..                       ...        ...        ...        ...    ...
113           General Freire      Chile -34.966700 -71.216400    722
114           Isla San Felix      Chile -26.293864 -80.096214    165
115  Robinson Crusoe Airport      Chile -33.665001 -78.929703    433
116                   Termal  Argentina -27.509946 -64.936666   1181
117          Caldera Airport      Chile -27.078052 -70.795305    180

[118 rows x 5 columns]


<details>
    <summary><b><u>Click Here for Answer Code</u></b></summary>

```python
sql_query_df = pd.read_sql("""

SELECT name, country,
CAST(latitude as float) AS latit,
CAST(longitude as float) AS longit,
CAST(altitude as int) AS altit

FROM airports

WHERE ( (country == 'Chile') OR (country == 'Argentina') )
AND 
altit BETWEEN 0 AND 2000


""", con)

sql_query_df

```
</details>

#### IN / NOT IN

- Get all records with a given field taking on a set of values.

SELECT col1, col2 <br> 
FROM table <br>
WHERE col1 IN (col_value1, col_value2, ...) <br>

#### Example

Get name, latitude, longitude for airports in Brazil, Argentina, Chile, and Uruguay

In [45]:

sql_query_df = pd.read_sql("""

SELECT name AS "Airport Name", 
        country,
       CAST(latitude AS float) AS "Latitude",
       CAST(longitude AS float) AS "Longitude"
       
FROM airports

WHERE country IN ("Argentina", "Brazil", "Chile", "Uruguay")
""", con)

sql_query_df

                           Airport Name    country   Latitude  Longitude
0                 Aeropuerto de Rafaela  Argentina -31.282072 -61.501594
1                 Comodoro Pierrestegui  Argentina -31.296944 -57.996631
2                          Gualeguaychu  Argentina -33.010278 -58.613056
3                                 Junin  Argentina -34.545889 -60.930556
4                       General Urquiza  Argentina -31.794778 -60.480361
..                                  ...        ...        ...        ...
362                     Caldera Airport      Chile -27.078052 -70.795305
363        San Pedro de Atacama Airport      Chile -22.918888 -68.162777
364  Aeroporto Estadual Arthur Siqueira     Brazil -22.979167 -46.537500
365                           Americana     Brazil -22.755800 -47.269402
366                            Pampulha     Brazil -19.851700 -43.950800

[367 rows x 4 columns]

##### Filtering rows with null (or no null) values in `WHERE` statement
- IS NULL
- IS NOT NULL

The `IS` operator:
- necessary when working with `NULL` values 
- Cannot use = or <> operators here.

In [46]:
pd.read_sql("""

SELECT name AS "Airport Name",
       code AS "Airport Code"
       
FROM airports

WHERE "Airport Code" IS NULL

""", con)

         Airport Name Airport Code
0         Forestville         None
1        Pitt Meadows         None
2               Blida         None
3           Bou Saada         None
4             Reggane         None
...               ...          ...
2222              Bus         None
2223              Bus         None
2224              Bus         None
2225     Main Station         None
2226  Algerciras Port         None

[2227 rows x 2 columns]

#### Exercise:

Get the count of records with nulls in the code column of the airport table

In [44]:
pd.read_sql("""

SELECT COUNT(*)
FROM airports
WHERE code IS NULL

""", con)

   COUNT(*)
0      2227

<details>
    <summary><b><u>Click Here for Answer Code</u></b></summary>

```python 
pd.read_sql("""

SELECT COUNT(*)
FROM airports
WHERE code IS NULL

""", con)
```
</details>

#### ORDER BY: Sorting Results

Use `ORDER BY` to identify the column(s) you want to sort on:
- `ASC` for ascending order (default)
- `DESC` for descending order

Get the name and code of airports with:
- top 10 highest altitudes.
- in order of decreasing altitude. 

Then get lowest 10 in increasing order.

In [47]:
pd.read_sql("""

SELECT name AS "Airport Name", 
       code,
       CAST(altitude AS int) AS "Altitude (ft)"
       
FROM airports

ORDER BY "Altitude (ft)" DESC

LIMIT 10
         
""", con)

            Airport Name  code  Altitude (ft)
0        Yading Daocheng   DCY          14472
1   Qamdo Bangda Airport   BPX          14219
2       Kangding Airport   KGT          14042
3                  Gunsa   NGQ          13780
4              Irkutsk-2  None          13411
5           El Alto Intl   LPB          13325
6          Lhasa-Gonggar   LXA          13136
7           Yushu Batang   YUS          13000
8  Capitan Nicolas Rojas   POI          12913
9     Copacabana Airport  None          12591

Ordering on multiple columns:

- Can order on one column first and then on another.

#### Example
Order by:
- decreasing latitudes
- increasing longitudes
- Altitude > 10000 ft.

In [48]:
pd.read_sql("""

SELECT name AS "Airport Name",
       CAST(altitude AS int) AS "Altitude (ft)",
       CAST(latitude AS float) AS "Airport Latitude",
       CAST(longitude AS float) AS "Airport Longitude"    
FROM airports
WHERE "Altitude (ft)" > 10000
ORDER BY "Airport Latitude" DESC, "Airport Longitude" 

""", con)

,Airport Name,Altitude (ft),Airport Latitude,Airport Longitude
0,Summit Camp,10552,72.579584,-38.459185
1,Summit Camp,11000,72.579187,-38.457200
2,Irkutsk-2,13411,52.367800,104.183000
3,Gannan,10466,34.490900,102.371900
4,Leh,10682,34.135872,77.546514
5,Maiwa,11500,33.058044,102.908775
6,Jiuzhaigou Huanglong,11311,32.857000,103.683000
7,Yushu Batang,13000,32.825000,97.125000
8,Hongyuan Airfield,11500,32.800428,102.534785
9,Gunsa,13780,32.100270,80.052778
10,Qamdo Bangda Airport,14219,30.553600,97.108300
11,Kangding Airport,14042,30.157500,101.734722
12,Shigatse Peace Airport,12408,29.351667,89.306944
13,Yading Daocheng,14472,29.323100,100.053300
14,Lhasa-Gonggar,13136,29.297778,90.911944
15,Manang,11000,28.633000,84.000000
16,Syangboche,12309,27.811187,86.712661
17,Francisco Carle,11034,-11.783144,-75.473394
18,Poroy Train Station,11710,-13.494400,-72.042100
19,Teniente Alejandro Velasco Astete Intl,10860,-13.535722,-71.938781
20,Andahuaylas,11300,-13.706408,-73.350378
21,Juliaca,12552,-15.467103,-70.158169
22,Copacabana Airport,12591,-16.183326,-69.087501
23,El Alto Intl,13325,-16.513339,-68.192256
24,Juan Mendoza,12146,-17.962589,-67.076236
25,Capitan Nicolas Rojas,12913,-19.543069,-65.723706
26,Isla Pescado,12020,-20.240932,-67.625380
27,Salar de Uyuni,12000,-20.330706,-67.046881
28,Uyuni Airport,11990,-20.466667,-66.833333
29,La Quiaca,11414,-22.150556,-65.577500

#### CASE WHEN STATEMENTS
Use `CASE` to create new columns using conditional logic:

E.g. partition altitudes into high, medium and low.

In [49]:
sql_query = pd.read_sql("""

SELECT name AS "Airport Name", 
       CAST(altitude AS int) AS "Altitude (ft)",
       CASE 
            WHEN CAST(altitude AS int) > 1000 THEN "High"
            WHEN CAST(altitude AS int) < 100 THEN "Low"
            ELSE "Moderate"
       END AS "Altitude Category"
       
FROM airports
         
LIMIT 20

""", con)

sql_query

                      Airport Name  Altitude (ft) Altitude Category
0                           Goroka           5282              High
1                           Madang             20               Low
2                      Mount Hagen           5388              High
3                           Nadzab            239          Moderate
4       Port Moresby Jacksons Intl            146          Moderate
5                       Wewak Intl             19               Low
6                       Narsarsuaq            112          Moderate
7                             Nuuk            283          Moderate
8                Sondre Stromfjord            165          Moderate
9                   Thule Air Base            251          Moderate
10                        Akureyri              6               Low
11                     Egilsstadir             76               Low
12                    Hornafjordur             24               Low
13                         Husavik             48               Low
14                      Isafjordur              8               Low
15  Keflavik International Airport            171          Moderate
16                  Patreksfjordur             11               Low
17                       Reykjavik             48               Low
18                    Siglufjordur             10               Low
19                  Vestmannaeyjar            326          Moderate

# Exercises

## Country List

Create a list of countries with airports and order them alphabetically A-Z.

> _Hint: You will need to remove duplicates._

<details>
    <summary><b><u>Click Here for Answer Code</u></b></summary>

```python 
pd.read_sql("""

SELECT DISTINCT country
FROM airports
ORDER BY country ASC

""", con)
```
</details>

## Southern Airports

Get the name, country and latitude of the 10 southern-most airports. 

> _Hint: Look for the smallest latitude._

<details>
    <summary><b><u>Click Here for Answer Code</u></b></summary>

```python 
pd.read_sql("""

SELECT name, country, CAST(latitude AS float) AS "Airport Latitude"
FROM airports
ORDER BY "Airport Latitude" ASC
LIMIT 10

""", con)
``` 
</details>

## Active UK Airlines

Create a list of active airlines in the United Kingdom from the airlines table. 

> _Hint: You will need to explore the airlines table to figure out how to do this._

<details>
    <summary><b><u>Click Here for Answer Code</u></b></summary>

```python 
pd.read_sql("""

SELECT name
FROM airlines
WHERE active='Y'
AND country='United Kingdom'

""", con)
```
</details>

**Exercise**

- Partition the airports into three latitude regions: 

- northern (>= 30), central (30,-30), and southern zones (<=-30).

Get me all the airports in the central and southern zones:
- whose altitude is greater than 3000 ft.
- and anywhere but in Brazil, Venezuela, Papua New Guinea, South Africa and Madagascar

<details>
    <summary><b><u>Click Here for Answer Code</u></b></summary>

```python 
sql_query = pd.read_sql("""

SELECT name AS "Airport Name", country,
       CAST(altitude AS int) AS "Altitude (ft)",
       CAST(latitude AS float) AS "Latitude (deg)",
       CASE 
            WHEN CAST(latitude AS float) >= 30 THEN "Northern"
            WHEN CAST(latitude AS float) <= -30 THEN "Southern"
            ELSE "Central"
       END lat_category
       
FROM airports

WHERE "Altitude (ft)" > 3000
AND
lat_category IN ("Central", "Southern")
AND
country NOT IN ("Brazil", "Venezuela", "Papua New Guinea", "South Africa", "Madagascar")


""", con)

sql_query
```
</details>